
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем Подсистемы;

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗависимостиПодсистем() Экспорт
	
	ИнициализироватьТаблицу();
	
	#Область АдресныйКлассификатор
	Подсистема = ДобавитьПодсистему("АдресныйКлассификатор");
	Подсистема.Синоним = Нстр("ru = 'Адресный классификатор'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ПолучениеФайловИзИнтернета");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("КонтактнаяИнформация");
	Подсистема.Описание = Нстр("ru = '•Хранение и предоставление адресного классификатора (ФИАС) для использования в других прикладных подсистемах.
		|•Ввод и проверка корректности адресов через Интернет с помощью веб-сервиса фирмы «1С».
		|•Загрузка адресного классификатора в программу с пользовательского раздела сайта фирмы «1С» или из указанного каталога (при автономной работе без постоянного подключения к Интернету).'");
	#КонецОбласти
	
	#Область АнализЖурналаРегистрации
	Подсистема = ДобавитьПодсистему("АнализЖурналаРегистрации");
	Подсистема.Синоним = Нстр("ru = 'Анализ журнала регистрации'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ВариантыОтчетов,РассылкаОтчетов");
	Подсистема.Описание = Нстр("ru = '•Отчеты по активности пользователей, по продолжительности работы регламентных заданий и о критичных записях в журнале регистрации.'");
	#КонецОбласти
	
	#Область Анкетирование
	Подсистема = ДобавитьПодсистему("Анкетирование");
	Подсистема.Синоним = Нстр("ru = 'Анкетирование'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("НастройкаПорядкаЭлементов");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Проведение анкетирования для внешних пользователей программы.
		|•Разработка шаблонов анкет и проведение опросов по списку респондентов.
		|•Средства анализа результатов анкетирования.'");
	#КонецОбласти
	
	#Область БазоваяФункциональность
	Подсистема = ДобавитьПодсистему("БазоваяФункциональность");
	Подсистема.Синоним = Нстр("ru = 'Базовая функциональность'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Процедуры и функции общего назначения, по работе со строками, с другими типами данных, с журналом регистрации и т. п.
		|•Стандартные роли (Администрирование, ПолныеПрава, ЗапускТонкогоКлиента и др.).
		|•Автоматическое отслеживание переименований объектов метаданных.
		|•Базовые сервисные возможности администратора программы (журнал регистрации, настройка заголовка окна программы и другое).'");
	#КонецОбласти
	
	#Область Банки
	Подсистема = ДобавитьПодсистему("Банки");
	Подсистема.Синоним = Нстр("ru = 'Банки'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ПолучениеФайловИзИнтернета");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Хранение и предоставление классификатора банков РФ (БИК) для использования в других прикладных подсистемах.
		|•Загрузка классификатора банков РФ (БИК) с диска ИТС и с веб-сайта РБК (www.rbc.ru), автоматически или по требованию.'");
	#КонецОбласти
	
	#Область БизнесПроцессыИЗадачи
	Подсистема = ДобавитьПодсистему("БизнесПроцессыИЗадачи");
	Подсистема.Синоним = Нстр("ru = 'Бизнес-процессы и задачи'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("РаботаСПочтовымиСообщениями,УправлениеДоступом");
	Подсистема.Описание = Нстр("ru = '•Интерактивный ввод задач для пользователей программы.
		|•Информирование пользователей об их текущих задачах.
		|•Мониторинг и контроль исполнения задач со стороны заинтересованных лиц - авторов и координаторов выполнения задач.
		|•Базовая функциональность для разработки произвольных бизнес-процессов в конфигурации.'");
	#КонецОбласти
	
	#Область Валюты
	Подсистема = ДобавитьПодсистему("Валюты");
	Подсистема.Синоним = Нстр("ru = 'Валюты'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ПолучениеФайловИзИнтернета");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Хранение и предоставление доступа к списку и курсам валют.
		|•Загрузка курсов валют с веб-сайта РБК (www.rbc.ru).
		|•Выбор валют из общероссийского классификатора (ОКВ).'");
	#КонецОбласти
	
	#Область ВариантыОтчетов
	Подсистема = ДобавитьПодсистему("ВариантыОтчетов");
	Подсистема.Синоним = Нстр("ru = 'Варианты отчетов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("РаботаСПочтовымиСообщениями");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ДополнительныеОтчетыИОбработки,РассылкаОтчетов");
	Подсистема.Описание = Нстр("ru = '•Совместная работа с вариантами отчетов, предусмотренных в программе и настроенных пользователями.
		|•Панель быстрого доступа к вариантам отчетов.
		|•Универсальная форма отчета с быстрыми настройками, отправкой отчетов по почте, настройкой рассылок отчетов, автосуммой и другими сервисными возможностями.
		|•Программный интерфейс по тонкой настройке внешнего вида отчетов.'");
	#КонецОбласти
	
	#Область ВерсионированиеОбъектов
	Подсистема = ДобавитьПодсистему("ВерсионированиеОбъектов");
	Подсистема.Синоним = Нстр("ru = 'Версионирование объектов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Хранение и просмотр истории изменений справочников и документов (пользователь, внесший изменения, время изменения и характер изменения с точностью до реквизитов объекта и реквизитов его табличных частей).
		|•Сравнение произвольных версий объектов.
		|•Просмотр и откат к ранее сохраненной версии объекта.'");
	#КонецОбласти
	
	#Область Взаимодействия
	Подсистема = ДобавитьПодсистему("Взаимодействия");
	Подсистема.Синоним = Нстр("ru = 'Взаимодействия'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("КонтактнаяИнформация,НастройкаПорядкаЭлементов,ПолнотекстовыйПоиск,РаботаСПочтовымиСообщениями,ПрисоединенныеФайлы,Свойства,ФайловыеФункции,ОтправкаSMS");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Планирование, регистрация и упорядочивание взаимодействий: переписка по электронной почте, звонки, встречи и сообщения SMS.
		|•Хранение всех взаимодействий и их контактов в информационной базе.
		|•Работа с результатами взаимодействий.'");
	#КонецОбласти
	
	#Область ГрафикиРаботы
	Подсистема = ДобавитьПодсистему("ГрафикиРаботы");
	Подсистема.Синоним = Нстр("ru = 'Графики работы'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("КалендарныеГрафики");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Хранение сведений о производственных календарях, используемых на предприятии.
		|•Получение даты, которая наступит через указанное количество дней по указанному календарю и другой программный интерфейс.'");
	#КонецОбласти
	
	#Область ГрупповоеИзменениеОбъектов
	Подсистема = ДобавитьПодсистему("ГрупповоеИзменениеОбъектов");
	Подсистема.Синоним = Нстр("ru = 'Групповое изменение объектов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Групповое изменение произвольных реквизитов и табличных частей объектов программы (справочников, документов и пр.).
		|•Возможность изменения значений дополнительных реквизитов и сведений.
		|•С учетом предустановленных в программе правил запрета редактирования реквизитов объектов.'");
	#КонецОбласти
	
	#Область ДатыЗапретаИзменения
	Подсистема = ДобавитьПодсистему("ДатыЗапретаИзменения");
	Подсистема.Синоним = Нстр("ru = 'Даты запрета изменения'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Блокировка изменений любых данных (документов, записей регистров, элементов справочников и др.), введенных ранее определенной даты.
		|•Гибкая настройка одной общей даты запрета изменения для всех объектов программы в целом либо нескольких дат по разделам и/или отдельным объектам разделов учета.'");
	#КонецОбласти
	
	#Область ДополнительныеОтчетыИОбработки
	Подсистема = ДобавитьПодсистему("ДополнительныеОтчетыИОбработки");
	Подсистема.Синоним = Нстр("ru = 'Дополнительные отчеты и обработки'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("Печать");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ВариантыОтчетов,ГрупповоеИзменениеОбъектов");
	Подсистема.Описание = Нстр("ru = '•Подключение к программе дополнительных (внешних) отчетов и обработок без внесения изменений в конфигурацию.
		|•Привязка дополнительных отчетов и обработок к конкретным типам объектов или разделам командного интерфейса.
		|•Регламентное выполнение обработок по расписанию.
		|•Средства администрирования списка дополнительных отчетов и обработок.'");
	#КонецОбласти
	
	#Область ЗавершениеРаботыПользователей
	Подсистема = ДобавитьПодсистему("ЗавершениеРаботыПользователей");
	Подсистема.Синоним = Нстр("ru = 'Завершение работы пользователей'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Просмотр и завершение активных сеансов работы в программе.
		|•Временная блокировка работы пользователей в программе, запрет регламентных заданий.'");
	#КонецОбласти
	
	#Область ЗагрузкаДанныхИзФайла
	Подсистема = ДобавитьПодсистему("ЗагрузкаДанныхИзФайла");
	Подсистема.Синоним = Нстр("ru = 'Загрузка данных из файла'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ДополнительныеОтчетыИОбработки,ГрупповоеИзменениеОбъектов");
	Подсистема.Описание = Нстр("ru = '•Загрузка табличных данных в произвольные справочники и табличные части документов.'");
	#КонецОбласти
	
	#Область ЗаметкиПользователя
	Подсистема = ДобавитьПодсистему("ЗаметкиПользователя");
	Подсистема.Синоним = Нстр("ru = 'Заметки пользователя'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Электронная замена стикеров по краям монитора, которой можно воспользоваться, не покидая окна своей программы.
		|•Быстрый список заметок на рабочем столе, список заметок по предмету, общий список.
		|•Различные цвета и оформление текста заметок, вставка картинок в заметки.'");
	#КонецОбласти
	
	#Область ЗапретРедактированияРеквизитовОбъектов
	Подсистема = ДобавитьПодсистему("ЗапретРедактированияРеквизитовОбъектов");
	Подсистема.Синоним = Нстр("ru = 'Запрет редактирования реквизитов объектов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Программный интерфейс для проверки обязательного заполнения некоторых реквизитов объектов, которые определяют характер данного объекта (условно называются «ключевыми» реквизитами).
		|•Запрет редактирования «ключевых» реквизитов записанных объектов.
		|•Проверка возможности изменения «ключевых» реквизитов пользователем, имеющим на это права.'");
	#КонецОбласти
	
	#Область ЗащитаПерсональныхДанных
	Подсистема = ДобавитьПодсистему("ЗащитаПерсональныхДанных");
	Подсистема.Синоним = Нстр("ru = 'Защита персональных данных'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("Печать,Организации");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Поддержка требований 152-ФЗ («О персональных данных»).
		|•Управление событиями доступа к персональным данным (установка использования события, получение актуального состояния использования событий, подготовка формы настройки системы).
		|•Классификация персональных данных по областям.
		|•Учет согласий на обработку персональных данных.'");
	#КонецОбласти
	
	#Область Интеграция1СБухфон
	Подсистема = ДобавитьПодсистему("Интеграция1СБухфон");
	Подсистема.Синоним = Нстр("ru = 'Интеграция c 1С-Бухфон'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Возможность пользователям инфраструктуры «1С-Бухфон» запускать приложение из конфигурации.'");
	#КонецОбласти
	
	#Область ИнформацияПриЗапуске
	Подсистема = ДобавитьПодсистему("ИнформацияПриЗапуске");
	Подсистема.Синоним = Нстр("ru = 'Информация при запуске'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Отображение различной информации (например, рекламы) при запуске программы.'");
	#КонецОбласти
	
	#Область КалендарныеГрафики
	Подсистема = ДобавитьПодсистему("КалендарныеГрафики");
	Подсистема.Синоним = Нстр("ru = 'Календарные графики'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Хранение сведений о календарных графиках, используемых на предприятии.'");
	#КонецОбласти
	
	#Область КонтактнаяИнформация
	Подсистема = ДобавитьПодсистему("КонтактнаяИнформация");
	Подсистема.Синоним = Нстр("ru = 'Контактная информация'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("НастройкаПорядкаЭлементов");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("АдресныйКлассификатор");
	Подсистема.Описание = Нстр("ru = '•Добавление к произвольным справочникам и документам реквизитов для ввода контактной информации: почтовых адресов, адресов электронной почты, телефонов и т. д.
		|•Автоматическая или ручная проверка корректности адресов (при совместном использовании с подсистемой «Адресный классификатор»).
		|•Предоставление классификатора стран мира (ОКСМ).'");
	#КонецОбласти
	
	#Область НапоминанияПользователя
	Подсистема = ДобавитьПодсистему("НапоминанияПользователя");
	Подсистема.Синоним = Нстр("ru = 'Напоминания пользователя'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Ввод персональных напоминаний в программе на нужное время.
		|•Привязка напоминаний к произвольным объектам программы.'");
	#КонецОбласти
	
	#Область НастройкаПорядкаЭлементов
	Подсистема = ДобавитьПодсистему("НастройкаПорядкаЭлементов");
	Подсистема.Синоним = Нстр("ru = 'Настройка порядка элементов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Настройка порядка элементов произвольных списков с помощью кнопок Вверх и Вниз.'");
	#КонецОбласти
	
	#Область НастройкиПрограммы
	Подсистема = ДобавитьПодсистему("НастройкиПрограммы");
	Подсистема.Синоним = Нстр("ru = 'Настройки программы'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("*");
	Подсистема.Описание = Нстр("ru = '•Готовые рабочие места (панели) для раздела «Администрирование».
		|•Подстройка состава панелей администрирования под текущий режим работы программы.'");
	#КонецОбласти
	
	#Область ОбменДанными
	Подсистема = ДобавитьПодсистему("ОбменДанными");
	Подсистема.Синоним = Нстр("ru = 'Обмен данными'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("РаботаСПочтовымиСообщениями");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ОбновлениеКонфигурации,РегламентныеЗадания,ПолучениеФайловИзИнтернета,ПрефиксацияОбъектов");
	Подсистема.Описание = Нстр("ru = '•Программный интерфейс и готовые рабочие места для организации совместной работы в распределенной информационной базе и для синхронизации данных с другими программами.
		|•Синхронизация данных по требованию и в автоматическом режиме по расписанию.
		|•Подключение через различные каналы связи: локальный или сетевой каталог, электронная почта, FTP-ресурс или через Интернет (в том числе синхронизация данных с приложениями в «облаке»).
		|•Гибкая настройка правил синхронизации данных между программами, помощник сопоставления одинаковых данных.
		|•Средства мониторинга и диагностики синхронизации данных.
		|•Возможность разработки планов обмена с использованием правил конвертации данных или без них, удобная отладка обработчиков событий правил конвертации в конфигураторе.
		|•Автоматическое обновление конфигурации подчиненного узла РИБ (при совместном использовании с подсистемой «Обновление конфигурации»).'");
	#КонецОбласти
	
	#Область ОбновлениеВерсииИБ
	Подсистема = ДобавитьПодсистему("ОбновлениеВерсииИБ");
	Подсистема.Синоним = Нстр("ru = 'Обновление версии ИБ'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Выполнение первоначального заполнения и обновления данных информационной базы при изменении версии конфигурации.
		|•Отображение информации об изменениях в новой версии конфигурации.
		|•Программный интерфейс для выполнения монопольных, оперативных и отложенных обработчиков обновления.'");
	#КонецОбласти
	
	#Область ОбновлениеКонфигурации
	Подсистема = ДобавитьПодсистему("ОбновлениеКонфигурации");
	Подсистема.Синоним = Нстр("ru = 'Обновление конфигурации'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ЗавершениеРаботыПользователей,ПолучениеФайловИзИнтернета");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("РаботаСПочтовымиСообщениями,ПроверкаЛегальностиПолученияОбновления");
	Подсистема.Описание = Нстр("ru = '•Автоматическое обновление конфигурации (без открытия конфигуратора) по требованию, в указанное время в будущем или при завершении работы программы.
		|•Проверка и получение обновлений конфигурации через Интернет (по требованию или по расписанию).
		|•Обновление из указанного файла на локальном или сетевом диске.
		|•Применение изменений основной конфигурации к конфигурации базы данных.'");
	#КонецОбласти
	
	#Область Организации
	Подсистема = ДобавитьПодсистему("Организации");
	Подсистема.Синоним = Нстр("ru = 'Организации'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("КонтактнаяИнформация");
	Подсистема.Описание = Нстр("ru = '•Ведение в программе справочника Организации с контактной информацией.
		|•Шаблон для разработки справочника Организации в прикладной конфигурации.'");
	#КонецОбласти
	
	#Область ОтправкаSMS
	Подсистема = ДобавитьПодсистему("ОтправкаSMS");
	Подсистема.Синоним = Нстр("ru = 'Отправка SMS'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ПолучениеФайловИзИнтернета");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Программный интерфейс по рассылке и проверка статусов доставки сообщений SMS.'");
	#КонецОбласти
	
	#Область ОценкаПроизводительности
	Подсистема = ДобавитьПодсистему("ОценкаПроизводительности");
	Подсистема.Синоним = Нстр("ru = 'Оценка производительности'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Оценка интегральной производительности системы по методике APDEX.
		|•Упрощает и автоматизирует сбор информации о времени выполнения каждой ключевой операции.
		|•Средства анализа результатов замера.
		|•Автоматический экспорт показателей производительности.'");
	#КонецОбласти
	
	#Область Печать
	Подсистема = ДобавитьПодсистему("Печать");
	Подсистема.Синоним = Нстр("ru = 'Печать'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ПрисоединенныеФайлы,ДополнительныеОтчетыИОбработки,РаботаСПочтовымиСообщениями");
	Подсистема.Описание = Нстр("ru = '•Программный интерфейс и готовое рабочее место для формирования печатных форм произвольных объектов программы.
		|•Вывод печатных форм в виде табличных документов и офисных документов в форматах Microsoft Word и OpenOffice.org Writer.
		|•Отправка печатных форм по электронной почте, сохранение на компьютер или в присоединенных файлах (при совместном использовании с подсистемой «Присоединенные файлы»).
		|•Подключение внешних печатных форм, а также печать внешних печатных форм в комплекте с основными печатными формами (при совместном использовании с подсистемой «Дополнительные отчеты и обработки»).
		|•Вывод в печатную форму изображения QR-кода по заданной текстовой строке.'");
	#КонецОбласти
	
	#Область ПоискИУдалениеДублей
	Подсистема = ДобавитьПодсистему("ПоискИУдалениеДублей");
	Подсистема.Синоним = Нстр("ru = 'Поиск и удаление дублей'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Поиск и удаление дублирующихся элементов справочников.'");
	#КонецОбласти
	
	#Область ПолнотекстовыйПоиск
	Подсистема = ДобавитьПодсистему("ПолнотекстовыйПоиск");
	Подсистема.Синоним = Нстр("ru = 'Полнотекстовый поиск'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Настройка и выполнение полнотекстового поиска по всем данным в программе.'");
	#КонецОбласти
	
	#Область ПолучениеФайловИзИнтернета
	Подсистема = ДобавитьПодсистему("ПолучениеФайловИзИнтернета");
	Подсистема.Синоним = Нстр("ru = 'Получение файлов из Интернета'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Программный интерфейс для получения файлов из Интернета.
		|•Получение файла из сети на клиенте.
		|•Сохранение файлов на клиентском компьютере, в информационной базе.
		|•Запрос и хранение параметров прокси-сервера.'");
	#КонецОбласти
	
	#Область Пользователи
	Подсистема = ДобавитьПодсистему("Пользователи");
	Подсистема.Синоним = Нстр("ru = 'Пользователи'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("КонтактнаяИнформация");
	Подсистема.Описание = Нстр("ru = '•Ведение списка пользователей, работающих в программе.
		|•Ведение списка внешних пользователей, имеющих ограниченный доступ к специализированным рабочим местам, предусмотренным в программе (например, «Мои заказы», «Анкеты респондента», «Оформление заявок» и т. п.).
		|•Настройка прав доступа пользователей и внешних пользователей (при внедрении совместно с подсистемой «Управление доступом» осуществляется средствами подсистемы «Управление доступом»).
		|•Группировка списка пользователей (и внешних пользователей).
		|•Очистка и копирование настроек отчетов, форм, рабочего стола, разделов командного интерфейса, избранного, печати табличных документов и других персональных настроек пользователей (и внешних пользователей).'");
	#КонецОбласти
	
	#Область ПрефиксацияОбъектов
	Подсистема = ДобавитьПодсистему("ПрефиксацияОбъектов");
	Подсистема.Синоним = Нстр("ru = 'Префиксация объектов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Автоматическое назначение префиксов объектам с учетом настроек программы.
		|•Префиксация объектов в разрезах информационных баз и элементов справочника Организации.
		|•Программный интерфейс для перепрефиксации справочников и документов при изменении префикса информационной базы.'");
	#КонецОбласти
	
	#Область ПрисоединенныеФайлы
	Подсистема = ДобавитьПодсистему("ПрисоединенныеФайлы");
	Подсистема.Синоним = Нстр("ru = 'Присоединенные файлы'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ФайловыеФункции");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Программный и пользовательский интерфейсы для присоединения файлов (вложений) к произвольным объектам программы.
		|•Поддержка произвольного количества разных типов владельцев файлов без потери в скорости работы в условиях ограничения доступа пользователей на уровне записей (RLS).
		|•Коллективное редактирование файлов, сканирование, электронная подпись и шифрование.'");
	#КонецОбласти
	
	#Область ПроверкаЛегальностиПолученияОбновления
	Подсистема = ДобавитьПодсистему("ПроверкаЛегальностиПолученияОбновления");
	Подсистема.Синоним = Нстр("ru = 'Проверка легальности получения обновления'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Программный и пользовательский интерфейсы для подтверждения легальности получения обновления конфигурации.'");
	#КонецОбласти
	
	#Область РаботаВМоделиСервиса
	Подсистема = ДобавитьПодсистему("РаботаВМоделиСервиса");
	Подсистема.Синоним = Нстр("ru = 'Работа в модели сервиса'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ОбменДанными,РегламентныеЗадания,ЗавершениеРаботыПользователей");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = 'Включает в себя ряд подсистем, необходимых для работы конфигурации в модели сервиса:
		|•Поддержка разделения данных (выделение общих классификаторов и настроек программы, которые используются в целом для всей информационной базы).
		|•Последовательное выполнение заданий в разных областях данных для снижения нагрузки на сервер «1С:Предприятия».
		|•Автоматическое создание резервных копий областей данных по расписанию.
		|Интеграция конфигурации с другими компонентами сервиса - менеджером сервиса и сервисом поставляемых данных:
		|•Механизм обмена сообщениями для гарантированной доставки сообщений между различными информационными системами.
		|•Синхронизация списков и прав пользователей в менеджере сервиса и в приложении.
		|•Управление областями данных из менеджера сервиса.
		|Также включает в себя ряд подсистем, не предназначенных для самостоятельного использования.
		|Их необходимо включать в конфигурацию только совместно с соответствующей основной подсистемой.
		|Например, если к внедрению отмечена подсистема «Валюты», следует также отметить и подсистему «Валюты в модели сервиса».'");
	#КонецОбласти
	
	#Область РаботаСКонтрагентами
	Подсистема = ДобавитьПодсистему("РаботаСКонтрагентами");
	Подсистема.Синоним = Нстр("ru = 'Работа с контрагентами'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("КонтактнаяИнформация");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Проверка реквизитов контрагентов по данным ФНС в справочнике контрагентов, документах, отчетах.
		|•Заполнение реквизитов контрагентов и формирование «Досье контрагента» по данным ЕГРЮЛ и ЕГРИП.'");
	#КонецОбласти
	
	#Область РаботаСПочтовымиСообщениями
	Подсистема = ДобавитьПодсистему("РаботаСПочтовымиСообщениями");
	Подсистема.Синоним = Нстр("ru = 'Работа с почтовыми сообщениями'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Программный интерфейс для отправки и получения сообщений электронной почты.
		|•Ведение списка учетных записей для работы с электронной почтой.
		|•Базовый пользовательский интерфейс для отправки сообщений.'");
	#КонецОбласти
	
	#Область РаботаСФайлами
	Подсистема = ДобавитьПодсистему("РаботаСФайлами");
	Подсистема.Синоним = Нстр("ru = 'Работа с файлами'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("Свойства,ФайловыеФункции");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("УправлениеДоступом");
	Подсистема.Описание = Нстр("ru = '•Коллективное редактирование файлов в иерархической структуре папок.
		|•Хранение и предоставление доступа к версиям файлов.
		|•Присоединение файлов из файловой системы, создание файлов по шаблону или получение со сканера.
		|•Электронная подпись, шифрование.'");
	#КонецОбласти
	
	#Область РассылкаОтчетов
	Подсистема = ДобавитьПодсистему("РассылкаОтчетов");
	Подсистема.Синоним = Нстр("ru = 'Рассылка отчетов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ВариантыОтчетов,КонтактнаяИнформация,ПолучениеФайловИзИнтернета,РаботаСПочтовымиСообщениями");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ДополнительныеОтчетыИОбработки,РаботаСФайлами,УправлениеДоступом,ГрупповоеИзменениеОбъектов");
	Подсистема.Описание = Нстр("ru = '•Рассылка отчетов и дополнительных отчетов по электронной почте.
		|•Публикация отчетов на FTP, в сетевых каталогах и в папках подсистемы «Работа с файлами».
		|•Запуск по расписанию или интерактивно.'");
	#КонецОбласти
	
	#Область РегламентныеЗадания
	Подсистема = ДобавитьПодсистему("РегламентныеЗадания");
	Подсистема.Синоним = Нстр("ru = 'Регламентные задания'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Вывод списка и настройка параметров регламентных заданий (расписание, запуск, остановка).'");
	#КонецОбласти
	
	#Область РезервноеКопированиеИБ
	Подсистема = ДобавитьПодсистему("РезервноеКопированиеИБ");
	Подсистема.Синоним = Нстр("ru = 'Резервное копирование ИБ'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ЗавершениеРаботыПользователей");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Сохранение резервных копий файловой информационной базы по требованию или по заданному расписанию.
		|•Восстановление файловой информационной базы из копии.
		|•Уведомление о необходимости настройки резервного копирования (также в клиент-серверном режиме).'");
	#КонецОбласти
	
	#Область Свойства
	Подсистема = ДобавитьПодсистему("Свойства");
	Подсистема.Синоним = Нстр("ru = 'Свойства'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("ЗапретРедактированияРеквизитовОбъектов");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Добавление дополнительных свойств к произвольным документам и справочникам.
		|•Вывод значений свойств в любых отчетах и динамических списках.
		|•Раздельное хранение свойств как в самом объекте (дополнительные реквизиты), так и вне объекта-владельца в отдельном регистре сведений (дополнительные сведения).
		|•Возможность задавать одинаковые свойства для различных объектов, свойства, обязательные к заполнению, и другие сервисные возможности.'");
	#КонецОбласти
	
	#Область СклонениеПредставленийОбъектов
	Подсистема = ДобавитьПодсистему("СклонениеПредставленийОбъектов");
	Подсистема.Синоним = Нстр("ru = 'Склонение представлений объектов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Автоматическое склонение представлений объектов с возможностью ручной корректировки пользователем.'");
	#КонецОбласти
	
	#Область СтруктураПодчиненности
	Подсистема = ДобавитьПодсистему("СтруктураПодчиненности");
	Подсистема.Синоним = Нстр("ru = 'Структура подчиненности'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Отображение информации о родительских и дочерних документах для выбранного документа, а также всей структуры их взаимосвязей.'");
	#КонецОбласти
	
	#Область ТекущиеДела
	Подсистема = ДобавитьПодсистему("ТекущиеДела");
	Подсистема.Синоним = Нстр("ru = 'Текущие дела'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Вывод списка текущих дел пользователя на рабочем столе (новые письма, задачи, заявки, несогласованные заказы и т. п.).'");
	#КонецОбласти
	
	#Область УдалениеПомеченныхОбъектов
	Подсистема = ДобавитьПодсистему("УдалениеПомеченныхОбъектов");
	Подсистема.Синоним = Нстр("ru = 'Удаление помеченных объектов'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Удаление объектов, помеченных на удаление. С контролем целостности (проверка ссылок на удаляемые объекты из других объектов).
		|•Фоновое удаление по расписанию.'");
	#КонецОбласти
	
	#Область УправлениеДоступом
	Подсистема = ДобавитьПодсистему("УправлениеДоступом");
	Подсистема.Синоним = Нстр("ru = 'Управление доступом'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Индивидуальная и групповая настройка прав доступа пользователей с помощью профилей и групп доступа.
		|•Настройка ограничений прав доступа на уровне записей - для отдельных элементов данных информационной базы (элементов справочников, документов, записей регистров и т. д.).
		|•Отчет по правам интересующего пользователя или группы пользователей.
		|•Предусмотрены два варианта внедрения в прикладное решение - обычный и упрощенный.
		|Обычный режим настройки прав доступа рассчитан на многопользовательские прикладные решения, в которых, как правило, выполняется групповая настройка прав, на базе групп доступа.
		|В упрощенном режиме настройка прав выполняется индивидуально для каждого пользователя.
		|Второй режим предназначен для конфигураций с небольшим числом пользователей, каждый из которых обладает своим собственным уникальным набором прав.'");
	#КонецОбласти
	
	#Область УправлениеИтогамиИАгрегатами
	Подсистема = ДобавитьПодсистему("УправлениеИтогамиИАгрегатами");
	Подсистема.Синоним = Нстр("ru = 'Управление итогами и агрегатами'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Администрирование итогов и агрегатов оборотных регистров накопления.
		|•Регламентное выполнение операций переноса границы итогов, пересчета и обновления агрегатов (по расписанию, при завершении работы программы).'");
	#КонецОбласти
	
	#Область ФайловыеФункции
	Подсистема = ДобавитьПодсистему("ФайловыеФункции");
	Подсистема.Синоним = Нстр("ru = 'Файловые функции'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.Описание = Нстр("ru = '•Технологическая подсистема, не предназначенная для самостоятельного использования; только совместно с подсистемами «Работа с файлами» и/или «Присоединенные файлы».
		|•Общие функции и базовые пользовательские интерфейсы по работе с файлами, хранение файлов в томах на диске, функции для поддержки РИБ и создания первоначального образа информационной базы.'");
	#КонецОбласти
	
	#Область ЦентрМониторинга
	Подсистема = ДобавитьПодсистему("ЦентрМониторинга");
	Подсистема.Синоним = Нстр("ru = 'Центр мониторинга'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("ОценкаПроизводительности");
	Подсистема.Описание = Нстр("ru = '•Собирает обезличенную статистику по использованию конфигурации
		|•Передает обезличенную статистику в единый центр контроля качества.'");
	#КонецОбласти
	
	#Область ЭлектроннаяПодпись
	Подсистема = ДобавитьПодсистему("ЭлектроннаяПодпись");
	Подсистема.Синоним = Нстр("ru = 'Электронная подпись'");
	Подсистема.ЗависитОтПодсистем = ЗависимостьОтПодсистем("");
	Подсистема.УсловноЗависитОтПодсистем = ЗависимостьОтПодсистем("КонтактнаяИнформация,АдресныйКлассификатор,Печать,РаботаСКонтрагентами,Организации");
	Подсистема.Описание = Нстр("ru = '•Программный и пользовательский интерфейс для работы со средствами криптографии: электронная подпись и проверка подписи.
		|•Отправка заявлений на выпуск сертификата КЭП в УЦ «1С» и установка их на компьютере.'");
	#КонецОбласти
	
	Возврат Подсистемы;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьТаблицу()
	
	Подсистемы = Новый ТаблицаЗначений;
	Подсистемы.Колонки.Добавить("Имя");
	Подсистемы.Колонки.Добавить("Синоним");
	Подсистемы.Колонки.Добавить("Обязательная");
	Подсистемы.Колонки.Добавить("ЗависитОтПодсистем");
	Подсистемы.Колонки.Добавить("УсловноЗависитОтПодсистем");
	Подсистемы.Колонки.Добавить("Описание");
	Подсистемы.Колонки.Добавить("Пометка");
	
КонецПроцедуры

Функция ЗависимостьОтПодсистем(ИменаПодсистем)
	
	Если ПустаяСтрока(ИменаПодсистем) Тогда
		ЗависитОтПодсистем = Новый Массив;
	Иначе
		ЗависитОтПодсистем = СтрРазделить(ИменаПодсистем, ",");
	КонецЕсли;
	Возврат ЗависитОтПодсистем;
	
КонецФункции

Функция ДобавитьПодсистему(ИмяПодсистемы)
	
	ОбязательныеПодсистемы = СтрРазделить("БазоваяФункциональность,ОбновлениеВерсииИБ,Пользователи", ",");
	
	НоваяСтрока = Подсистемы.Добавить();
	НоваяСтрока.Имя = ИмяПодсистемы;
	НоваяСтрока.Обязательная = ОбязательныеПодсистемы.Найти(ИмяПодсистемы) <> Неопределено;
	НоваяСтрока.Пометка = НоваяСтрока.Обязательная;
	
	Возврат НоваяСтрока;
	
КонецФункции

#КонецОбласти

#КонецЕсли